---
kind: method
id: M:Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.MEPCalculationServerInfo)
source: html/7df99f5f-9a93-da4d-8e7e-9ec43300018d.htm
---
# Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor Method

Constructs a new copy of the input MEPCalculationServerInfo object.

## Syntax (C#)
```csharp
public MEPCalculationServerInfo(
	MEPCalculationServerInfo other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.MEPCalculationServerInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null